computing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-20 Tue 00:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I Do My Computing</title>
<meta name="author" content="Ramsay Carslaw" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">How I Do My Computing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcdd8b10">1. Introduction</a></li>
<li><a href="#orgfdf901b">2. System and Tooling</a></li>
<li><a href="#orgf468d5e">3. Principles</a>
<ul>
<li><a href="#orge07c07f">3.1. 1. Prefer the keyboard</a></li>
<li><a href="#orgc5ecd2e">3.2. 2. Avoid fullscreen</a></li>
<li><a href="#orgc21882c">3.3. 3. Minimise Apps</a></li>
<li><a href="#orgbfd0adf">3.4. 4. Configurability above all else</a></li>
<li><a href="#org1ffe135">3.5. 5. Plain text is king</a></li>
<li><a href="#orgbe8db0a">3.6. 6. Consistency</a></li>
<li><a href="#orgb84e711">3.7. 7. Startup time is important</a>
<ul>
<li><a href="#org220b6e2">3.7.1. 7 (a). Splash screens are evil</a></li>
<li><a href="#org588fd5e">3.7.2. 7 (b). Emacs client</a></li>
</ul>
</li>
<li><a href="#orgef1e8ac">3.8. 8. Anesthetics Matter</a></li>
<li><a href="#orgbbf01db">3.9. 9. Separate 'light' and 'heavy' tasks</a></li>
<li><a href="#org5d87306">3.10. 10. Efficiency is everything</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdd8b10" class="outline-2">
<h2 id="orgcdd8b10"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I decided to make this document on how I use my computer, in the hopes
it is useful to someone.
</p>
</div>
</div>

<div id="outline-container-orgfdf901b" class="outline-2">
<h2 id="orgfdf901b"><span class="section-number-2">2.</span> System and Tooling</h2>
<div class="outline-text-2" id="text-2">
<p>
I use macOS for everything. I find the built in Apple apps to be more
than good enough for most tasks. There are a few execptions. The
default window manager is horrible, for this reason I use rectangle to
control my windows.
</p>
</div>
</div>

<div id="outline-container-orgf468d5e" class="outline-2">
<h2 id="orgf468d5e"><span class="section-number-2">3.</span> Principles</h2>
<div class="outline-text-2" id="text-3">
<p>
I follow some general principles when I use my computer
</p>
</div>

<div id="outline-container-orge07c07f" class="outline-3">
<h3 id="orge07c07f"><span class="section-number-3">3.1.</span> 1. Prefer the keyboard</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The mouse is slower for almost every task, try and avoid using it.
</p>
</div>
</div>

<div id="outline-container-orgc5ecd2e" class="outline-3">
<h3 id="orgc5ecd2e"><span class="section-number-3">3.2.</span> 2. Avoid fullscreen</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Use vertical windows on the homepage, managed with Rectangle. This way
I can use the keyboard to <span class="underline">temporarily</span> enlarge windows and then snap
them back. Opening multiple windows is better then clicking on a large
full screen window.
</p>
</div>
</div>

<div id="outline-container-orgc21882c" class="outline-3">
<h3 id="orgc21882c"><span class="section-number-3">3.3.</span> 3. Minimise Apps</h3>
<div class="outline-text-3" id="text-3-3">
<p>
It is better to have one program you know well (vim, emacs) then one
for each problem (IntelliJ, CLion etc). You can learn this program
more deeply and become more efficient.
</p>
</div>
</div>

<div id="outline-container-orgbfd0adf" class="outline-3">
<h3 id="orgbfd0adf"><span class="section-number-3">3.4.</span> 4. Configurability above all else</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The best programs are the ones that let you customise them completely.
Any program that isn't configurable will eventually slow you down.
</p>
</div>
</div>

<div id="outline-container-org1ffe135" class="outline-3">
<h3 id="org1ffe135"><span class="section-number-3">3.5.</span> 5. Plain text is king</h3>
<div class="outline-text-3" id="text-3-5">
<p>
It is always better to work with plain text files then using non
standard file formats, the exception being PDF.
</p>
</div>
</div>

<div id="outline-container-orgbe8db0a" class="outline-3">
<h3 id="orgbe8db0a"><span class="section-number-3">3.6.</span> 6. Consistency</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Try and use the same colorscheme everywhere, I use github dark. Also
try to match font sizes, font faces and anything else. I also use
 vim keys everywhere. Keeping these things consistent removes distractions
 when you are focusing and switching between tasks.
</p>
</div>
</div>

<div id="outline-container-orgb84e711" class="outline-3">
<h3 id="orgb84e711"><span class="section-number-3">3.7.</span> 7. Startup time is important</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Every tool you use should be able to have an instance open near
instantly and be closed quickly. Every tool you use should be able to
be launched from the command line. vim is perfect for this, as is
server mode emacs. On macOS the <code>open</code> command is particularly good
for this.
</p>
</div>

<div id="outline-container-org220b6e2" class="outline-4">
<h4 id="org220b6e2"><span class="section-number-4">3.7.1.</span> 7 (a). Splash screens are evil</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
Delete any app that has a startup window before you actually are able to use the app.
</p>
</div>
</div>

<div id="outline-container-org588fd5e" class="outline-4">
<h4 id="org588fd5e"><span class="section-number-4">3.7.2.</span> 7 (b). Emacs client</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
Use emacs client on macos
</p>
</div>
</div>
</div>

<div id="outline-container-orgef1e8ac" class="outline-3">
<h3 id="orgef1e8ac"><span class="section-number-3">3.8.</span> 8. Anesthetics Matter</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Much like you would prefer to work at a desk with a great view then a
desk facing a wall, how your programs look and feel will affect your
productivity. Customise them to look pleasing.
</p>
</div>
</div>

<div id="outline-container-orgbbf01db" class="outline-3">
<h3 id="orgbbf01db"><span class="section-number-3">3.9.</span> 9. Separate 'light' and 'heavy' tasks</h3>
<div class="outline-text-3" id="text-3-9">
<p>
I have a chain of command for which program is used for an edit. If
it's modifying one file within a small projetct I use vim with an
extremely minimal config (no plugins). For more IDE like features
I use neovim or emacs with a complete LSP config.
</p>
</div>
</div>

<div id="outline-container-org5d87306" class="outline-3">
<h3 id="org5d87306"><span class="section-number-3">3.10.</span> 10. Efficiency is everything</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Try and learn lots of features from your editor. It is not enough to
minimise keystrokes, you must also minimise thought about the
specifics of editing. Like playing an instrument you want to focus
on the music not your fingers! 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ramsay Carslaw</p>
<p class="date">Created: 2022-12-20 Tue 00:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
